NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/dfu/src/nrf_mesh_dfu.c
static void tx_end_handle(dfu_tx_t* p_tx, timestamp_t prev_timeout)
{
    if (p_tx->tx_count == BL_IF_TX_REPEATS_INF &&
        p_tx->repeats  == BL_IF_TX_REPEATS_INF)
    {
        p_tx->order_time = prev_timeout;
        p_tx->tx_count = 0;
    }
    else if (p_tx->tx_count >= p_tx->repeats)
    {
        p_tx->repeats = 0;
    }
}

static void interrupts_disable(void)
{
#if !defined(HOST)
    uint32_t interrupt_setting_mask = NVIC->ISER[0];

    /* Loop through and disable all interrupts. */
    for (uint32_t irq = 0; irq < MAX_NUMBER_INTERRUPTS; irq++)
    {
        if (interrupt_setting_mask & (1UL << irq))
        {
            NVIC_DisableIRQ((IRQn_Type) irq);
        }
    }
#endif
}

static void build_adv_packet(void)
{
    ble_gap_addr_t adv_addr;
    (void) advertiser_address_default_get(&adv_addr);
    memcpy(m_adv_packet.addr, adv_addr.addr, BLE_GAP_ADDR_LEN);
    m_adv_packet.header.addr_type = adv_addr.addr_type;
    m_adv_packet.header.type = BLE_PACKET_TYPE_ADV_NONCONN_IND;
}

static bool transmit_dfu_packet(const nrf_mesh_dfu_packet_t * p_dfu_packet, uint32_t dfu_packet_length)
{
    if (m_broadcast.active)
    {
        return false;
    }

    ble_ad_data_t * p_ad = (ble_ad_data_t *) &m_adv_packet.payload[0];
    ble_ad_data_service_data_t * p_service_data = (ble_ad_data_service_data_t *) &p_ad->data[0];
    m_adv_packet.header.length = dfu_packet_length + DFU_PACKET_OVERHEAD;
    p_ad->length            = DFU_PACKET_PAYLOAD_OVERHEAD + dfu_packet_length;
    p_ad->type              = AD_TYPE_DFU;
    p_service_data->uuid    = BLE_ADV_SERVICE_DATA_UUID_DFU;
    memcpy(&p_service_data->data[0], p_dfu_packet, dfu_packet_length);

    NRF_MESH_ERROR_CHECK(broadcast_send(&m_broadcast));
    return true;
}

static inline uint16_t tx_randomization_offset_get(void)
{
    return (uint16_t) rand_prng_get(&m_prng) & DFU_TX_DELAY_RANDOMIZATION_MASK_US;
}

static void tx_timeout_handled(dfu_tx_t * p_tx)
{
    if (p_tx->tx_count < p_tx->repeats)
    {
        p_tx->tx_count++;
        p_tx->tx_randomization_offset_us = tx_randomization_offset_get();
    }
}

static void tx_timeout(uint32_t timestamp, void* p_context)
{
    uint32_t next_timeout = timestamp + (UINT32_MAX / 2);
    for (uint32_t i = 0; i < NRF_MESH_DFU_TX_SLOTS; ++i)
    {
        if (tx_slot_in_use(&m_tx_slots[i]))
        {
            uint32_t timeout = next_tx_timeout(&m_tx_slots[i]);
            if (TIMER_OLDER_THAN(timeout, (timestamp + DFU_TX_TIMER_MARGIN_US)))
            {
                if (m_tx_slots[i].rx_count >= DFU_TX_REDUNDANCY_MAX)
                {
                    /* We've seen this handle on air multiple times, skip this transmit. */
                    tx_timeout_handled(&m_tx_slots[i]);
                }
                else
                {
                    if (transmit_dfu_packet(&m_tx_slots[i].dfu_packet, m_tx_slots[i].dfu_packet_len))
                    {
                        tx_timeout_handled(&m_tx_slots[i]);
                    }
                }
                m_tx_slots[i].rx_count = 0;
                tx_end_handle(&m_tx_slots[i], timeout);
                timeout = next_tx_timeout(&m_tx_slots[i]);
            }
            if (tx_slot_in_use(&m_tx_slots[i]) && TIMER_OLDER_THAN(timeout, next_timeout))
            {
                next_timeout = timeout;
            }
        }
    }
    timer_sch_reschedule(&m_tx_timer_evt, next_timeout);
}

static void abort_timeout(uint32_t timestamp, void* p_context)
{
    __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "ABORT Timeout fired @%d\n", timestamp);
    bl_cmd_t abort_cmd;
    abort_cmd.type = BL_CMD_TYPE_DFU_ABORT;
    if (nrf_mesh_dfu_cmd_send(&abort_cmd) == NRF_SUCCESS)
    {
        end_transfer(NRF_MESH_DFU_END_ERROR_TIMEOUT);
    }
}

static void timer_timeout(uint32_t timestamp, void* p_context)
{
    __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Timeout fired @%d\n", timestamp);
    bl_cmd_t timeout_cmd;
    timeout_cmd.type = BL_CMD_TYPE_TIMEOUT;
    timeout_cmd.params.timeout.timer_index = 0;
    (void) nrf_mesh_dfu_cmd_send(&timeout_cmd);
}

static void flash_op_complete(mesh_flash_user_t user, const flash_operation_t * p_op, uint16_t token)
{
    NRF_MESH_ASSERT(user == MESH_FLASH_USER_DFU);
    bl_cmd_t end_cmd;
    switch (p_op->type)
    {
        case FLASH_OP_TYPE_WRITE:
            end_cmd.type = BL_CMD_TYPE_FLASH_WRITE_COMPLETE;
            end_cmd.params.flash.write.p_data = p_op->params.write.p_data;
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Write complete (0x%x)\n", p_op->params.write.p_data);
            break;
        case FLASH_OP_TYPE_ERASE:
            end_cmd.type = BL_CMD_TYPE_FLASH_ERASE_COMPLETE;
            end_cmd.params.flash.erase.p_dest = p_op->params.erase.p_start_addr;
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Erase complete (0x%x)\n", p_op->params.erase.p_start_addr);
            break;
        case FLASH_OP_TYPE_ALL:
            end_cmd.type = BL_CMD_TYPE_FLASH_ALL_COMPLETE;
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Flash idle.\n");
            break;
        default:
            NRF_MESH_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }

    (void) nrf_mesh_dfu_cmd_send(&end_cmd); /* don't care about the return code */
}

/**
 * Go through the TX slots and bump the redundancy counter on any packet
 * matching the given packet.
 */
static void tx_packet_redundancy_check(const nrf_mesh_dfu_packet_t* p_packet, uint32_t length)
{
    if (p_packet->packet_type == DFU_PACKET_TYPE_DATA &&
        p_packet->payload.data.segment > 0)
    {
        for (uint32_t i = 0; i < NRF_MESH_DFU_TX_SLOTS; ++i)
        {
            if (tx_slot_in_use(&m_tx_slots[i]))
            {
                /* Check for packet match */

                if (m_tx_slots[i].dfu_packet.packet_type                 == DFU_PACKET_TYPE_DATA &&
                    m_tx_slots[i].dfu_packet.payload.data.segment        == p_packet->payload.data.segment &&
                    m_tx_slots[i].dfu_packet.payload.data.transaction_id == p_packet->payload.data.transaction_id &&
                    m_tx_slots[i].rx_count < (1 << (8 * sizeof(m_tx_slots[i].rx_count))) - 1) /* Check that we're not about to wrap around */
                {
                    uint32_t was_masked;
                    _DISABLE_IRQS(was_masked);
                    m_tx_slots[i].rx_count++;
                    _ENABLE_IRQS(was_masked);
                    break;
                }
            }
        }
    }
}

static uint32_t dfu_evt_handler(const bl_evt_t* p_evt)
{
    uint32_t return_code = NRF_SUCCESS;
    switch (p_evt->type)
    {
        case BL_EVT_TYPE_ECHO:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tEcho: %s\n", p_evt->params.echo.str);
            break;
        case BL_EVT_TYPE_DFU_ABORT:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tAbort event. Reason: 0x%x\n", p_evt->params.dfu.abort.reason);
                end_transfer(p_evt->params.dfu.abort.reason);
            }
            break;

        case BL_EVT_TYPE_DFU_NEW_FW:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tNew firmware!\n");
                nrf_mesh_evt_t evt;
                evt.type = NRF_MESH_EVT_DFU_FIRMWARE_OUTDATED_NO_AUTH;
                evt.params.dfu.fw_outdated.transfer.dfu_type = p_evt->params.dfu.new_fw.fw_type;
                evt.params.dfu.fw_outdated.transfer.id       = p_evt->params.dfu.new_fw.fwid;
                if (get_curr_fwid(
                            p_evt->params.dfu.new_fw.fw_type,
                            &evt.params.dfu.fw_outdated.current) == NRF_SUCCESS)
                {
                    event_handle(&evt);
                }
            }
            break;

        case BL_EVT_TYPE_DFU_REQ:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tSource/relay request!\n");
                /* Forward to application */
                nrf_mesh_evt_t evt;
                switch (p_evt->params.dfu.req.role)
                {
                    case NRF_MESH_DFU_ROLE_RELAY:
                        evt.type = NRF_MESH_EVT_DFU_REQ_RELAY;
                        evt.params.dfu.req_relay.transfer.dfu_type = p_evt->params.dfu.req.dfu_type;
                        evt.params.dfu.req_relay.transfer.id = p_evt->params.dfu.req.fwid;
                        evt.params.dfu.req_relay.authority = p_evt->params.dfu.req.authority;
                        break;
                    case NRF_MESH_DFU_ROLE_SOURCE:
                        evt.type = NRF_MESH_EVT_DFU_REQ_SOURCE;
                        evt.params.dfu.req_source.dfu_type = p_evt->params.dfu.req.dfu_type;
                        break;
                    default:
                        return NRF_ERROR_NOT_SUPPORTED;
                }
                event_handle(&evt);
            }
            break;

        case BL_EVT_TYPE_DFU_START:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tDFU start\n");
                if (p_evt->params.dfu.start.role == NRF_MESH_DFU_ROLE_TARGET)
                {
                    m_transfer_state.state = NRF_MESH_DFU_STATE_TARGET;
                }
                else
                {
                    m_transfer_state.state = NRF_MESH_DFU_STATE_RELAY;
                }
                m_transfer_state.segment_count = 0;
                m_transfer_state.role = p_evt->params.dfu.start.role;
                m_transfer_state.fwid = p_evt->params.dfu.start.fwid;
                nrf_mesh_evt_t evt;
                evt.type = NRF_MESH_EVT_DFU_START;
                evt.params.dfu.start.transfer.dfu_type = p_evt->params.dfu.start.dfu_type;
                evt.params.dfu.start.transfer.id = p_evt->params.dfu.start.fwid;
                evt.params.dfu.start.role = p_evt->params.dfu.start.role;
                event_handle(&evt);
                m_timer_evt.cb = abort_timeout;
                timer_sch_reschedule(&m_timer_evt, timer_now() + TIMER_START_TIMEOUT_US);
            }
            break;

        case BL_EVT_TYPE_DFU_DATA_SEGMENT_RX:
            m_transfer_state.segment_count++;
            m_transfer_state.total_segments = p_evt->params.dfu.data_segment.total_segments;
            m_timer_evt.cb = abort_timeout;
            timer_sch_reschedule(&m_timer_evt, timer_now() + TIMER_DATA_TIMEOUT_US);
            break;

        case BL_EVT_TYPE_DFU_END:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tDFU END!\n");
                end_transfer(NRF_MESH_DFU_END_SUCCESS);
            }
            break;

        case BL_EVT_TYPE_BANK_AVAILABLE:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tDFU BANK AVAILABLE\n");
                nrf_mesh_evt_t evt;
                evt.type = NRF_MESH_EVT_DFU_BANK_AVAILABLE;
                evt.params.dfu.bank.transfer.dfu_type   = p_evt->params.bank_available.bank_dfu_type;
                evt.params.dfu.bank.transfer.id         = p_evt->params.bank_available.bank_fwid;
                evt.params.dfu.bank.p_start_addr        = p_evt->params.bank_available.p_bank_addr;
                evt.params.dfu.bank.length              = p_evt->params.bank_available.bank_length;
                evt.params.dfu.bank.is_signed           = p_evt->params.bank_available.is_signed;
                event_handle(&evt);
            }
            break;

