NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/dfu/src/nrf_mesh_dfu.c
        case BL_EVT_TYPE_FLASH_ERASE:
            {
                if (!IS_PAGE_ALIGNED(p_evt->params.flash.erase.p_start_addr))
                {
                    return_code = NRF_ERROR_INVALID_ADDR;
                }
                else
                {
                    flash_operation_t flash_op;
                    flash_op.type = FLASH_OP_TYPE_ERASE;
                    flash_op.params.erase.p_start_addr = (uint32_t *) p_evt->params.flash.erase.p_start_addr;
                    flash_op.params.erase.length = p_evt->params.flash.erase.length;
                    return_code = mesh_flash_op_push(MESH_FLASH_USER_DFU, &flash_op, NULL);
                }
            }
            break;

        case BL_EVT_TYPE_FLASH_WRITE:
            {
                if (!IS_WORD_ALIGNED(p_evt->params.flash.write.p_start_addr) ||
                    !IS_WORD_ALIGNED(p_evt->params.flash.write.p_data))
                {
                    return_code = NRF_ERROR_INVALID_ADDR;
                }
                else if (!IS_WORD_ALIGNED(p_evt->params.flash.write.length))
                {
                    return_code = NRF_ERROR_INVALID_LENGTH;
                }
                else
                {
                    flash_operation_t flash_op;
                    flash_op.type = FLASH_OP_TYPE_WRITE;
                    flash_op.params.write.p_start_addr = p_evt->params.flash.write.p_start_addr;
                    flash_op.params.write.p_data = (const uint32_t *) p_evt->params.flash.write.p_data;
                    flash_op.params.write.length = p_evt->params.flash.write.length;
                    return_code = mesh_flash_op_push(MESH_FLASH_USER_DFU, &flash_op, NULL);
                }
            }
            break;

        case BL_EVT_TYPE_TX_RADIO:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tRADIO TX! SLOT %d, count %d, interval: %s, handle: %x\n",
                        p_evt->params.tx.radio.tx_slot,
                        p_evt->params.tx.radio.tx_count,
                        p_evt->params.tx.radio.interval_type == BL_RADIO_INTERVAL_TYPE_EXPONENTIAL ? "exponential" : "periodic",
                        p_evt->params.tx.radio.p_dfu_packet->packet_type
                     );

                dfu_tx_t* p_tx_slot = &m_tx_slots[p_evt->params.tx.radio.tx_slot];

                if (tx_slot_in_use(p_tx_slot))
                {
                    __LOG(LOG_SRC_DFU, LOG_LEVEL_WARN, "Killing a TX slot prematurely (repeats done: %u).\n", p_tx_slot->tx_count);
                }
                /* Disable the slot */
                p_tx_slot->repeats = 0;

                uint32_t time_now = timer_now();

                /* Fill the TX slot. */
                p_tx_slot->interval_type = p_evt->params.tx.radio.interval_type;
                p_tx_slot->tx_count = 0;
                p_tx_slot->rx_count = 0;
                p_tx_slot->tx_randomization_offset_us = 0;
                p_tx_slot->order_time = time_now + DFU_TX_TIMER_MARGIN_US + (rand_prng_get(&m_prng) & DFU_TX_DELAY_RANDOMIZATION_MASK_US);
                p_tx_slot->dfu_packet_len = p_evt->params.tx.radio.length;
                memcpy(&p_tx_slot->dfu_packet, p_evt->params.tx.radio.p_dfu_packet, p_evt->params.tx.radio.length);

                p_tx_slot->repeats = p_evt->params.tx.radio.tx_count;

                /* Fire away */
                if (m_tx_timer_evt.state == TIMER_EVENT_STATE_UNUSED || TIMER_OLDER_THAN(p_tx_slot->order_time, m_tx_timer_evt.timestamp))
                {
                    timer_sch_reschedule(&m_tx_timer_evt, p_tx_slot->order_time);
                }
            }
            break;

        case BL_EVT_TYPE_TX_SERIAL:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tSERIAL TX!\n");
            break;

        case BL_EVT_TYPE_TX_ABORT:
            if (p_evt->params.tx.abort.tx_slot >= NRF_MESH_DFU_TX_SLOTS)
            {
                return_code = NRF_ERROR_INVALID_PARAM;
            }
            else if (!tx_slot_in_use(&m_tx_slots[p_evt->params.tx.abort.tx_slot]))
            {
                return_code = NRF_ERROR_INVALID_STATE;
            }
            else
            {
                m_tx_slots[p_evt->params.tx.abort.tx_slot].repeats = 0;
            }
            break;

        case BL_EVT_TYPE_TIMER_SET:
            {
                m_timer_evt.cb = timer_timeout;
                timestamp_t set_time = timer_now() + p_evt->params.timer.set.delay_us;
                timer_sch_reschedule(&m_timer_evt, set_time);
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tTIMER set: %uus delay (@%u)\n", p_evt->params.timer.set.delay_us, set_time);
            }
            break;

        case BL_EVT_TYPE_TIMER_ABORT:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tTIMER abort: %d\n", p_evt->params.timer.abort.index);
            timer_sch_abort(&m_timer_evt);
            break;

        case BL_EVT_TYPE_ERROR:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_ERROR, "\tBL ERROR: %x @%s:L%u\n",
                    p_evt->params.error.error_code,
                    p_evt->params.error.p_file,
                    p_evt->params.error.line);
            NRF_MESH_ASSERT(false);
            break;
        default:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_WARN, "\tUNSUPPORTED EVENT\n");
            return_code = NRF_ERROR_NOT_SUPPORTED;
            break;
    }
    return return_code;
}

#if !defined(HOST)
static uint32_t dfu_cmd_handler_set(bl_if_cmd_handler_t handler)
{
    if (handler == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (BOOTLOADERADDR() == 0xFFFFFFFF)
    {
        /* No bootloader present. */
        return NRF_ERROR_NOT_SUPPORTED;
    }
    if (((uint32_t) handler >= DEVICE_FLASH_END_GET()) ||
        ((uint32_t) handler < BOOTLOADERADDR()))
    {
        /* out of bounds. */
        return NRF_ERROR_INVALID_ADDR;
    }
    m_cmd_handler = handler;
    return NRF_SUCCESS;
}
#endif

static void tx_complete_cb(broadcast_params_t * p_broadcast, uint32_t timestamp)
{
    /* Do nothing */
}
/*****************************************************************************
* Interface functions
*****************************************************************************/

uint32_t nrf_mesh_dfu_init(void)
{
    uint32_t error_code;
#if !defined(HOST)
    error_code = dfu_cmd_handler_set(*((bl_if_cmd_handler_t*) (DEVICE_DATA_RAM_END_GET() - sizeof(bl_if_cmd_handler_t))));
    if (error_code != NRF_SUCCESS)
    {
        m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
        return NRF_ERROR_NOT_SUPPORTED;
    }
#else
    /* Must have been set externally */
    NRF_MESH_ASSERT(m_cmd_handler != NULL);
#endif

    rand_prng_seed(&m_prng);

    m_timer_evt.cb           = timer_timeout;
    m_timer_evt.interval     = 0;
    m_timer_evt.p_context    = NULL;
    m_timer_evt.p_next       = NULL;
    m_tx_timer_evt.cb        = tx_timeout;
    m_tx_timer_evt.interval  = 0;
    m_tx_timer_evt.p_context = NULL;
    m_tx_timer_evt.p_next    = NULL;

    bl_cmd_t init_cmd =
    {
        .type = BL_CMD_TYPE_INIT,
        .params.init.bl_if_version = BL_IF_VERSION,
        .params.init.event_callback = dfu_evt_handler,
        .params.init.timer_count = 1,
        .params.init.tx_slots = NRF_MESH_DFU_TX_SLOTS,
        .params.init.in_app = true
    };

    error_code = nrf_mesh_dfu_cmd_send(&init_cmd);

    if (error_code != NRF_SUCCESS)
    {
        m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
        return error_code;
    }

    build_adv_packet();

