NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/dfu/src/nrf_mesh_dfu.c
    m_broadcast.params.access_address = BEARER_ACCESS_ADDR_DEFAULT;
    m_broadcast.params.channel_count = sizeof(m_adv_channels) / sizeof(m_adv_channels[0]);
    m_broadcast.params.p_channels = m_adv_channels;
    m_broadcast.params.radio_config.radio_mode = RADIO_MODE_BLE_1MBIT;
    m_broadcast.params.radio_config.payload_maxlen = BLE_ADV_PACKET_OVERHEAD + BLE_ADV_PACKET_PAYLOAD_MAX_LENGTH;
    m_broadcast.params.radio_config.tx_power = RADIO_POWER_NRF_0DBM;
    m_broadcast.params.tx_complete_cb = tx_complete_cb;
    m_broadcast.params.p_packet = &m_adv_packet;

    bl_cmd_t fwid_cmd;
    fwid_cmd.type = BL_CMD_TYPE_INFO_GET;
    fwid_cmd.params.info.get.type = BL_INFO_TYPE_VERSION;
    fwid_cmd.params.info.get.p_entry = NULL;
    error_code = nrf_mesh_dfu_cmd_send(&fwid_cmd);
    if (error_code != NRF_SUCCESS)
    {
        /* no version info */
        m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
        return error_code;
    }

    mp_curr_fwid = &fwid_cmd.params.info.get.p_entry->version;

    mesh_flash_user_callback_set(MESH_FLASH_USER_DFU, flash_op_complete);

    m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
    return error_code;
}

uint32_t nrf_mesh_dfu_enable(void)
{
    bl_cmd_t enable_cmd =
    {
        .type = BL_CMD_TYPE_ENABLE,
        .params = {{0}}
    };
    return nrf_mesh_dfu_cmd_send(&enable_cmd);
}

uint32_t nrf_mesh_dfu_jump_to_bootloader(void)
{
    if (BOOTLOADERADDR() != 0xFFFFFFFF)
    {
        interrupts_disable();
        hal_device_reset(BL_GPREGRET_FORCED_REBOOT);
        return NRF_SUCCESS; /* unreachable */
    }
    else
    {
        /* the BOOTLOADERADDR() isn't set, and we have no way to find the bootloader-address. */
        return NRF_ERROR_FORBIDDEN;
    }
}

uint32_t nrf_mesh_dfu_rx(const uint8_t * p_packet,
                         uint32_t length,
                         const nrf_mesh_rx_metadata_t * p_metadata)
{
    const nrf_mesh_dfu_packet_t * p_dfu_packet = (const nrf_mesh_dfu_packet_t *) p_packet;
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_dfu_packet == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (p_dfu_packet->packet_type < DFU_HANDLE_RANGE_START)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    if (mesh_flash_in_progress())
    {
        return NRF_ERROR_BUSY;
    }

    tx_packet_redundancy_check(p_dfu_packet, length);

    bl_cmd_t rx_cmd =
    {
        .type = BL_CMD_TYPE_RX,
        .params.rx.p_dfu_packet = p_dfu_packet,
        .params.rx.length = length
    };

    return nrf_mesh_dfu_cmd_send(&rx_cmd);
}

uint32_t nrf_mesh_dfu_request(nrf_mesh_dfu_type_t type,
        const nrf_mesh_fwid_t* p_fwid,
        const uint32_t* p_bank_addr)
{
    if (m_transfer_state.state != NRF_MESH_DFU_STATE_INITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_fwid == NULL || p_bank_addr == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_START_TARGET;
    cmd.params.dfu.start.target.type = type;
    cmd.params.dfu.start.target.fwid = *p_fwid;
    cmd.params.dfu.start.target.p_bank_start = p_bank_addr;
    uint32_t error_code = nrf_mesh_dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        m_transfer_state.role = NRF_MESH_DFU_ROLE_TARGET;
        m_transfer_state.type = type;
        m_transfer_state.fwid = *p_fwid;
        m_transfer_state.state = NRF_MESH_DFU_STATE_DFU_REQ;
        m_transfer_state.segment_count = 0;
        m_transfer_state.total_segments = 0;
        m_timer_evt.cb = abort_timeout;
        timer_sch_reschedule(&m_tx_timer_evt, timer_now() + NRF_MESH_DFU_REQ_TIMEOUT_US);
    }
    return error_code;
}

uint32_t nrf_mesh_dfu_relay(nrf_mesh_dfu_type_t type,
        const nrf_mesh_fwid_t* p_fwid)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_fwid == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_START_RELAY;
    cmd.params.dfu.start.relay.type = type;
    cmd.params.dfu.start.relay.fwid = *p_fwid;
    cmd.params.dfu.start.relay.transaction_id = 0;
    uint32_t error_code = nrf_mesh_dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        m_transfer_state.role = NRF_MESH_DFU_ROLE_RELAY;
        m_transfer_state.type = type;
        m_transfer_state.fwid = *p_fwid;
        m_transfer_state.state = NRF_MESH_DFU_STATE_RELAY_CANDIDATE;
        m_transfer_state.segment_count = 0;
        m_transfer_state.total_segments = 0;
    }
    return error_code;
}

uint32_t nrf_mesh_dfu_abort(void)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_ABORT;
    uint32_t error_code = nrf_mesh_dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        reset_transfer_state();
    }
    return error_code;
}

uint32_t nrf_mesh_dfu_bank_info_get(nrf_mesh_dfu_type_t type, nrf_mesh_dfu_bank_info_t* p_bank_info)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_bank_info == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_BANK_INFO_GET;
    cmd.params.dfu.bank_info_get.bank_dfu_type = type;
    cmd.params.dfu.bank_info_get.p_bank_info = p_bank_info;
    return nrf_mesh_dfu_cmd_send(&cmd);
}

uint32_t nrf_mesh_dfu_bank_flash(nrf_mesh_dfu_type_t bank_type)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_BANK_FLASH;
    cmd.params.dfu.bank_flash.bank_dfu_type = bank_type;
    return nrf_mesh_dfu_cmd_send(&cmd);
}

uint32_t nrf_mesh_dfu_state_get(nrf_mesh_dfu_transfer_state_t* p_dfu_transfer_state)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_dfu_transfer_state == NULL)
    {
        return NRF_ERROR_NULL;
    }
    p_dfu_transfer_state->role  = m_transfer_state.role;
    p_dfu_transfer_state->type  = m_transfer_state.type;
    p_dfu_transfer_state->fwid  = m_transfer_state.fwid;
    p_dfu_transfer_state->state = m_transfer_state.state;
    p_dfu_transfer_state->data_progress = (uint8_t) (
            ((uint32_t) m_transfer_state.segment_count * 100) /
            ((uint32_t) m_transfer_state.total_segments));
    return NRF_SUCCESS;
}

uint32_t nrf_mesh_dfu_cmd_send(bl_cmd_t* p_cmd)
{
    if (m_cmd_handler == NULL)
    {
        __LOG(LOG_SRC_DFU, LOG_LEVEL_ERROR, "ERROR: No CMD handler!\n");
        return NRF_ERROR_NOT_SUPPORTED;
    }
    if (p_cmd == NULL)
    {
        return NRF_ERROR_NULL;
    }
    /* Suspend flash operations for the duration of the command to avoid
       premature flash-events disturbing the flow */
    mesh_flash_set_suspended(true);
    uint32_t error_code = m_cmd_handler(p_cmd);
    mesh_flash_set_suspended(false);
    return error_code;
}
